robertinant/emt/src/ti/runtime/wiring/msp432e/variants/MSP_EXP432E401Y/Board_init.c
/*
 * Array of Pin configurations
 * NOTE: The order of the pin configurations must coincide with what was
 *       defined in MSP_EXP432E401Y.h
 * NOTE: Pins not used for interrupts should be placed at the end of the
 *       array.  Callback entries can be omitted from callbacks array to
 *       reduce memory usage.
 */
GPIO_PinConfig gpioPinConfigs[] = {
    /* port_pin */
    GPIOMSP432E4_EMPTY_PIN | GPIO_DO_NOT_CONFIG,    /*  0  - dummy */

    /* pins 1-10 */
    GPIOMSP432E4_EMPTY_PIN | GPIO_DO_NOT_CONFIG,    /*  1  - 3.3V */
    GPIOMSP432E4_PE4 | GPIO_DO_NOT_CONFIG,          /*  2  - PE4 */
    GPIOMSP432E4_PC4 | GPIO_DO_NOT_CONFIG,          /*  3  - PC4 */
    GPIOMSP432E4_PC5 | GPIO_DO_NOT_CONFIG,          /*  4  - PC5 */
    GPIOMSP432E4_PC6 | GPIO_DO_NOT_CONFIG,          /*  5  - PC6 */
    GPIOMSP432E4_PE5 | GPIO_DO_NOT_CONFIG,          /*  6  - PE5 */
    GPIOMSP432E4_PD3 | GPIO_DO_NOT_CONFIG,          /*  7  - PD3 */
    GPIOMSP432E4_PC7 | GPIO_DO_NOT_CONFIG,          /*  8  - PC7 */
    GPIOMSP432E4_PB2 | GPIO_DO_NOT_CONFIG,          /*  9  - PB2 */
    GPIOMSP432E4_PB3 | GPIO_DO_NOT_CONFIG,          /*  10 - PB3 */

    /* pins 11-20 */
    GPIOMSP432E4_PP2 | GPIO_DO_NOT_CONFIG,          /*  11 - PP2 */
    GPIOMSP432E4_PN3 | GPIO_DO_NOT_CONFIG,          /*  12 - PN3 */
    GPIOMSP432E4_PN2 | GPIO_DO_NOT_CONFIG,          /*  13 - PN2 */
    GPIOMSP432E4_PD0 | GPIO_DO_NOT_CONFIG,          /*  14 - PD0 */
    GPIOMSP432E4_PD1 | GPIO_DO_NOT_CONFIG,          /*  15 - PD1 */
    GPIOMSP432E4_EMPTY_PIN | GPIO_DO_NOT_CONFIG,    /*  16 - RESET */
    GPIOMSP432E4_PH3 | GPIO_DO_NOT_CONFIG,          /*  17 - PH3 */
    GPIOMSP432E4_PH2 | GPIO_DO_NOT_CONFIG,          /*  18 - PH2 */
    GPIOMSP432E4_PM3 | GPIO_DO_NOT_CONFIG,          /*  19 - PM3 */
    GPIOMSP432E4_EMPTY_PIN | GPIO_DO_NOT_CONFIG,    /*  20 - GND */

    /* pins 21-30 */
    GPIOMSP432E4_EMPTY_PIN | GPIO_DO_NOT_CONFIG,    /*  21 - 5V */
    GPIOMSP432E4_EMPTY_PIN | GPIO_DO_NOT_CONFIG,    /*  22 - GND */
    GPIOMSP432E4_PE0 | GPIO_DO_NOT_CONFIG,          /*  23 - PE0 */
    GPIOMSP432E4_PE1 | GPIO_DO_NOT_CONFIG,          /*  24 - PE1 */
    GPIOMSP432E4_PE2 | GPIO_DO_NOT_CONFIG,          /*  25 - PE2 */
    GPIOMSP432E4_PE3 | GPIO_DO_NOT_CONFIG,          /*  26 - PE3 */
    GPIOMSP432E4_PD7 | GPIO_DO_NOT_CONFIG,          /*  27 - PD7 */
    GPIOMSP432E4_PD6 | GPIO_DO_NOT_CONFIG,          /*  28 - PD6 */
    GPIOMSP432E4_PM4 | GPIO_DO_NOT_CONFIG,          /*  29 - PM4 */
    GPIOMSP432E4_PM5 | GPIO_DO_NOT_CONFIG,          /*  30 - PM5 */

    /* pins 31-40 */
    GPIOMSP432E4_PL3 | GPIO_DO_NOT_CONFIG,          /*  31 - PL3 */
    GPIOMSP432E4_PL2 | GPIO_DO_NOT_CONFIG,          /*  32 - PL2 */
    GPIOMSP432E4_PL1 | GPIO_DO_NOT_CONFIG,          /*  33 - PL1 */
    GPIOMSP432E4_PL0 | GPIO_DO_NOT_CONFIG,          /*  34 - PL0 */
    GPIOMSP432E4_PL5 | GPIO_DO_NOT_CONFIG,          /*  35 - PL5 */
    GPIOMSP432E4_PL4 | GPIO_DO_NOT_CONFIG,          /*  36 - PL4 */
    GPIOMSP432E4_PG0 | GPIO_DO_NOT_CONFIG,          /*  37 - PG0 */
    GPIOMSP432E4_PF3 | GPIO_DO_NOT_CONFIG,          /*  38 - PF3 */
    GPIOMSP432E4_PF2 | GPIO_DO_NOT_CONFIG,          /*  39 - PF2 */
    GPIOMSP432E4_PF1 | GPIO_DO_NOT_CONFIG,          /*  40 - PF1 */

    /* pins 41-50 */
    GPIOMSP432E4_EMPTY_PIN | GPIO_DO_NOT_CONFIG,    /*  41  - 3.3V */
    GPIOMSP432E4_PD2 | GPIO_DO_NOT_CONFIG,          /*  42 - PD2 */
    GPIOMSP432E4_PP0 | GPIO_DO_NOT_CONFIG,          /*  43 - PP0 */
    GPIOMSP432E4_PP1 | GPIO_DO_NOT_CONFIG,          /*  44 - PP1 */
    GPIOMSP432E4_PD4 | GPIO_DO_NOT_CONFIG,          /*  45 - PD4 */
    GPIOMSP432E4_PD5 | GPIO_DO_NOT_CONFIG,          /*  46 - PD5 */
    GPIOMSP432E4_PQ0 | GPIO_DO_NOT_CONFIG,          /*  47 - PQ0 */
    GPIOMSP432E4_PP4 | GPIO_DO_NOT_CONFIG,          /*  48 - PP4 */
    GPIOMSP432E4_PN5 | GPIO_DO_NOT_CONFIG,          /*  49 - PN5 */
    GPIOMSP432E4_PN4 | GPIO_DO_NOT_CONFIG,          /*  50 - PN4 */

    /* pins 51-60 */
    GPIOMSP432E4_PM6 | GPIO_DO_NOT_CONFIG,          /*  51 - PM6 */
    GPIOMSP432E4_PQ1 | GPIO_DO_NOT_CONFIG,          /*  52 - PQ1 */
    GPIOMSP432E4_PP3 | GPIO_DO_NOT_CONFIG,          /*  53 - PP3 */
    GPIOMSP432E4_PQ3 | GPIO_DO_NOT_CONFIG,          /*  54 - PQ3 */
    GPIOMSP432E4_PQ2 | GPIO_DO_NOT_CONFIG,          /*  55 - PQ2 */
    GPIOMSP432E4_EMPTY_PIN | GPIO_DO_NOT_CONFIG,    /*  56 - RESET */
    GPIOMSP432E4_PA7 | GPIO_DO_NOT_CONFIG,          /*  57 - PA7 */
    GPIOMSP432E4_PP5 | GPIO_DO_NOT_CONFIG,          /*  58 - PP5 */
    GPIOMSP432E4_PM7 | GPIO_DO_NOT_CONFIG,          /*  59 - PM7 */
    GPIOMSP432E4_EMPTY_PIN | GPIO_DO_NOT_CONFIG,    /*  60 - GND */

    /* pins 61-70 */
    GPIOMSP432E4_EMPTY_PIN | GPIO_DO_NOT_CONFIG,    /*  61 - 5V */
    GPIOMSP432E4_EMPTY_PIN | GPIO_DO_NOT_CONFIG,    /*  62 - GND */
    GPIOMSP432E4_PB4 | GPIO_DO_NOT_CONFIG,          /*  63 - PB4 */
    GPIOMSP432E4_PB5 | GPIO_DO_NOT_CONFIG,          /*  64 - PB5 */
    GPIOMSP432E4_PK0 | GPIO_DO_NOT_CONFIG,          /*  65 - PK0 */
    GPIOMSP432E4_PK1 | GPIO_DO_NOT_CONFIG,          /*  66 - PK1 */
    GPIOMSP432E4_PK2 | GPIO_DO_NOT_CONFIG,          /*  67 - PK2 */
    GPIOMSP432E4_PK3 | GPIO_DO_NOT_CONFIG,          /*  68 - PK3 */
    GPIOMSP432E4_PA4 | GPIO_DO_NOT_CONFIG,          /*  69 - PA4 */
    GPIOMSP432E4_PA5 | GPIO_DO_NOT_CONFIG,          /*  70 - PA5 */

    /* pins 71-80 */
    GPIOMSP432E4_PK7 | GPIO_DO_NOT_CONFIG,          /*  71 - PK7 */
    GPIOMSP432E4_PK5 | GPIO_DO_NOT_CONFIG,          /*  72 - PK5 */
    GPIOMSP432E4_PH1 | GPIO_DO_NOT_CONFIG,          /*  73 - PH1 */
    GPIOMSP432E4_PH0 | GPIO_DO_NOT_CONFIG,          /*  74 - PH0 */
    GPIOMSP432E4_PM2 | GPIO_DO_NOT_CONFIG,          /*  75 - PM2 */
    GPIOMSP432E4_PM1 | GPIO_DO_NOT_CONFIG,          /*  76 - PM1 */
    GPIOMSP432E4_PM0 | GPIO_DO_NOT_CONFIG,          /*  77 - PM0 */
    GPIOMSP432E4_PK5 | GPIO_DO_NOT_CONFIG,          /*  78 - PK5 */
    GPIOMSP432E4_PK4 | GPIO_DO_NOT_CONFIG,          /*  79 - PK4 */
    GPIOMSP432E4_PG1 | GPIO_DO_NOT_CONFIG,          /*  80 - PG1 */

