robertinant/emt/src/ti/runtime/wiring/msp432e/variants/MSP_EXP432E401Y/Board_init.c
    /* virtual pins 81-86 */
    GPIOMSP432E4_PJ0 | GPIO_DO_NOT_CONFIG,          /*  81 - PJ0 SW1 */
    GPIOMSP432E4_PJ1 | GPIO_DO_NOT_CONFIG,          /*  82 - PJ1 SW2 */
    GPIOMSP432E4_PN1 | GPIO_DO_NOT_CONFIG,          /*  83 - PN1 D1 */
    GPIOMSP432E4_PN0 | GPIO_DO_NOT_CONFIG,          /*  84 - PN0 D2 */
    GPIOMSP432E4_PF4 | GPIO_DO_NOT_CONFIG,          /*  85 - PF4 D3 */
    GPIOMSP432E4_PF0 | GPIO_DO_NOT_CONFIG,          /*  86 - PF0 D4 */
};

/*
 * Array of callback function pointers
 * NOTE: The order of the pin configurations must coincide with what was
 *       defined in MSP_EXP432E401Y.h
 * NOTE: Pins not used for interrupts can be omitted from callbacks array to
 *       reduce memory usage (if placed at end of gpioPinConfigs array).
 */
GPIO_CallbackFxn gpioCallbackFunctions[] = {
    /* port_pin */
    NULL,  /*  0  - dummy */

    /* pins 1-10 */
    NULL,  /*  1  - 3.3V */
    NULL,  /*  2  - PE4 */
    NULL,  /*  3  - PC4 */
    NULL,  /*  4  - PC5 */
    NULL,  /*  5  - PC6 */
    NULL,  /*  6  - PE5 */
    NULL,  /*  7  - PD3 */
    NULL,  /*  8  - PC7 */
    NULL,  /*  9  - PB2 */
    NULL,  /*  10 - PB3 */

    /* pins 11-20 */
    NULL,  /*  11 - PP2 */
    NULL,  /*  12 - PN3 */
    NULL,  /*  13 - PN2 */
    NULL,  /*  14 - PD0 */
    NULL,  /*  15 - PD1 */
    NULL,  /*  16 - RESET */
    NULL,  /*  17 - PH3 */
    NULL,  /*  18 - PH2 */
    NULL,  /*  19 - PM3 */
    NULL,  /*  20 - GND */

    /* pins 21-30 */
    NULL,  /*  21 - 5V */
    NULL,  /*  22 - GND */
    NULL,  /*  23 - PE0 */
    NULL,  /*  24 - PE1 */
    NULL,  /*  25 - PE2 */
    NULL,  /*  26 - PE3 */
    NULL,  /*  27 - PD7 */
    NULL,  /*  28 - PD6 */
    NULL,  /*  29 - PM4 */
    NULL,  /*  30 - PM5 */

    /* pins 31-40 */
    NULL,  /*  31 - PL3 */
    NULL,  /*  32 - PL2 */
    NULL,  /*  33 - PL1 */
    NULL,  /*  34 - PL0 */
    NULL,  /*  35 - PL5 */
    NULL,  /*  36 - PL4 */
    NULL,  /*  37 - PG0 */
    NULL,  /*  38 - PF3 */
    NULL,  /*  39 - PF2 */
    NULL,  /*  40 - PF1 */

    /* pins 41-50 */
    NULL,  /*  41  - 3.3V */
    NULL,  /*  42 - PD2 */
    NULL,  /*  43 - PP0 */
    NULL,  /*  44 - PP1 */
    NULL,  /*  45 - PD4 */
    NULL,  /*  46 - PD5 */
    NULL,  /*  47 - PQ0 */
    NULL,  /*  48 - PP4 */
    NULL,  /*  49 - PN5 */
    NULL,  /*  50 - PN4 */

    /* pins 51-60 */
    NULL,  /*  51 - PM6 */
    NULL,  /*  52 - PQ1 */
    NULL,  /*  53 - PP3 */
    NULL,  /*  54 - PQ3 */
    NULL,  /*  55 - PQ2 */
    NULL,  /*  56 - RESET */
    NULL,  /*  57 - PA7 */
    NULL,  /*  58 - PP5 */
    NULL,  /*  59 - PM7 */
    NULL,  /*  60 - GND */

    /* pins 61-70 */
    NULL,  /*  61 - 5V */
    NULL,  /*  62 - GND */
    NULL,  /*  63 - PB4 */
    NULL,  /*  64 - PB5 */
    NULL,  /*  65 - PK0 */
    NULL,  /*  66 - PK1 */
    NULL,  /*  67 - PK2 */
    NULL,  /*  68 - PK3 */
    NULL,  /*  69 - PA4 */
    NULL,  /*  70 - PA5 */

    /* pins 71-80 */
    NULL,  /*  71 - PK7 */
    NULL,  /*  72 - PK5 */
    NULL,  /*  73 - PH1 */
    NULL,  /*  74 - PH0 */
    NULL,  /*  75 - PM2 */
    NULL,  /*  76 - PM1 */
    NULL,  /*  77 - PM0 */
    NULL,  /*  78 - PK5 */
    NULL,  /*  79 - PK4 */
    NULL,  /*  80 - PG1 */
    
    /* virtual pins 81-88 */
    NULL,  /*  81 - PJ0 SW1 */
    NULL,  /*  82 - PJ1 SW2 */
    NULL,  /*  83 - PN1 D1 */
    NULL,  /*  84 - PN0 D2 */
    NULL,  /*  85 - PF4 D3 */
    NULL,  /*  86 - PF0 D4 */
};

/* The device-specific GPIO_config structure */
const GPIOMSP432E4_Config GPIOMSP432E4_config = {
    .pinConfigs = (GPIO_PinConfig *)gpioPinConfigs,
    .callbacks = (GPIO_CallbackFxn *)gpioCallbackFunctions,
    .numberOfPinConfigs = sizeof(gpioPinConfigs)/sizeof(GPIO_PinConfig),
    .numberOfCallbacks = sizeof(gpioCallbackFunctions)/sizeof(GPIO_CallbackFxn),
    .intPriority = (~0)
};

/*
 *  =============================== I2C ===============================
 */
#include <ti/drivers/I2C.h>
#include <ti/drivers/i2c/I2CMSP432E4.h>

I2CMSP432E4_Object i2cMSP432E4Objects[MSP_EXP432E401Y_I2CCOUNT];

const I2CMSP432E4_HWAttrs i2cMSP432E4HWAttrs[MSP_EXP432E401Y_I2CCOUNT] = {
    {
        .baseAddr = I2C7_BASE,
        .intNum = INT_I2C7,
        .intPriority = (~0),
        .sclPin = I2CMSP432E4_PD0_I2C7SCL,
        .sdaPin = I2CMSP432E4_PD1_I2C7SDA
    },
    {
        .baseAddr = I2C0_BASE,
        .intNum = INT_I2C0,
        .intPriority = (~0),
        .sclPin = I2CMSP432E4_PB2_I2C0SCL,
        .sdaPin = I2CMSP432E4_PB3_I2C0SDA
    }
};

const I2C_Config I2C_config[MSP_EXP432E401Y_I2CCOUNT] = {
    {
        .fxnTablePtr = &I2CMSP432E4_fxnTable,
        .object = &i2cMSP432E4Objects[MSP_EXP432E401Y_I2C7],
        .hwAttrs = &i2cMSP432E4HWAttrs[MSP_EXP432E401Y_I2C7]
    },
    {
        .fxnTablePtr = &I2CMSP432E4_fxnTable,
        .object = &i2cMSP432E4Objects[MSP_EXP432E401Y_I2C0],
        .hwAttrs = &i2cMSP432E4HWAttrs[MSP_EXP432E401Y_I2C0]
    },
};

const uint_least8_t I2C_count = MSP_EXP432E401Y_I2CCOUNT;

/*
 *  =============================== NVS ===============================
 */
#include <ti/drivers/NVS.h>
#include <ti/drivers/nvs/NVSMSP432E4.h>

#define SECTORSIZE       (0x4000)
#define NVS_REGIONS_BASE (0xF8000)
#define REGIONSIZE       (SECTORSIZE * 2)

/*
 * Reserve flash sectors for NVS driver use
 * by placing an uninitialized byte array
 * at the desired flash address.
 */
#if defined(__TI_COMPILER_VERSION__)

/*
 * Place uninitialized array at NVS_REGIONS_BASE
 */
#pragma LOCATION(flashBuf, NVS_REGIONS_BASE);
#pragma NOINIT(flashBuf);
static char flashBuf[REGIONSIZE];

#elif defined(__IAR_SYSTEMS_ICC__)

/*
 * Place uninitialized array at NVS_REGIONS_BASE
 */
__no_init static char flashBuf[REGIONSIZE] @ NVS_REGIONS_BASE;

#elif defined(__GNUC__)

/*
 * Place the flash buffers in the .nvs section created in the gcc linker file.
 * The .nvs section enforces alignment on a sector boundary but may
 * be placed anywhere in flash memory.  If desired the .nvs section can be set
 * to a fixed address by changing the following in the gcc linker file:
 *
 * .nvs (FIXED_FLASH_ADDR) (NOLOAD) : AT (FIXED_FLASH_ADDR) {
 *      *(.nvs)
 * } > REGION_TEXT
 */
__attribute__ ((section (".nvs")))
static char flashBuf[REGIONSIZE];

#endif

NVSMSP432E4_Object nvsMSP432E4Objects[MSP_EXP432E401Y_NVSCOUNT];

const NVSMSP432E4_HWAttrs nvsMSP432E4HWAttrs[MSP_EXP432E401Y_NVSCOUNT] = {
    {
        .regionBase = (void *) flashBuf,
        .regionSize = REGIONSIZE,
    },
};

